app/controllers/shopper_controller.rb

  def index

    if session[:userid] != nil and session[:userid] != ""
      if params[:search] == "Search" and params[:searchField] != ""
        @products = Product.where("description LIKE ? or name LIKE ?","%" + params[:searchField] + "%","%" + params[:searchField] + "%")
        @userCart = Cart.where(userId: session["userid"])
        @orders = Order.where(userId: session["userid"])
        @orderIds = Array.new
        @orders.each do |o|
          @orderIds.append(o.orderid)
        end
        @orderIds.uniq!
      else
        if (params[:logout] == "Logout")
          redirect_to "http://localhost:3000/shopper/logout"
        end
        if (params[:reviewCart] == "Review Cart")
          redirect_to "http://localhost:3000/shopper/cart"
        end
        if (params[:emptyCart] == "Empty Cart")
          Cart.where(userId: session["userid"]).destroy_all
        end
        if (params[:productName] == nil and params[:cartItemProductName] == nil)
          @products = Product.all
          @userCart = Cart.where(userId: session["userid"])
          @orders = Order.where(userId: session["userid"])
          @orderIds = Array.new
          @orders.each do |o|
---
SELECT "products".* FROM "products" WHERE (description LIKE '%ruby%' or name LIKE '%ruby%')
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "neha"]]
SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "neha"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 16]]
SELECT "products".* FROM "products"

          end
          @orderIds.uniq!
        elsif (params[:productName] != nil)
          cartRecord = Cart.where(userId: session["userid"], productName:params[:productName])
          if cartRecord.count == 0
---
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ? LIMIT ?  [["userId", "neha"], ["productName", "The Ruby Programming Language: Everything You Need to Know"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ?  [["userId", "neha"], ["productName", "The Ruby Programming Language: Everything You Need to Know"]]

            cartObject.productName = params[:productName]
            cartObject.cost = params[:cost]
            cartObject.quantity = 1
            cartObject.save
          else
            cartObject = Cart.find_by(userId: session["userid"], productName:params[:productName])
            cartObject.quantity = cartObject.quantity + 1
            cartObject.cost = cartObject.cost + params[:cost].to_f
            cartObject.save
          end
          @products = Product.all
          @userCart = Cart.where(userId: session["userid"])
          @orders = Order.where(userId: session["userid"])
          @orderIds = Array.new
          @orders.each do |o|
---
UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["cost", 56.42], ["updated_at", "2022-12-04 01:08:03.534545"], ["id", 7]]
INSERT INTO "carts" ("userId", "productName", "quantity", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ? LIMIT ?  [["userId", "neha"], ["productName", "The Ruby Programming Language: Everything You Need to Know"], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 11], ["cost", 310.31], ["updated_at", "2022-12-04 18:35:05.822985"], ["id", 12]]
SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "neha"]]

  def login
    if request.post?
      shoppers = Shopper.where(userid: params[:userid], password: Digest::SHA256.hexdigest(params[:password])[50])
      if shoppers.count > 0
---
SELECT COUNT(*) FROM "shoppers" WHERE "shoppers"."userid" = ? AND "shoppers"."password" = ?  [["userid", "neha"], ["password", "1"]]

  def new
    if request.post?
      shopper = Shopper.new
      shopper.userid = params[:userid]
      shopper.name = params[:name]
      shopper.password = Digest::SHA256.hexdigest(params[:password])[50]
      shopper.email = params[:email]
      shopper.save
---
INSERT INTO "shoppers" ("name", "userid", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "neha"], ["userid", "nehasadh"], ["password", "2"], ["email", "nehasadh008@gmail.com"], ["created_at", "2023-03-29 03:37:15.736861"], ["updated_at", "2023-03-29 03:37:15.736861"]]

  def cart
    if params[:back] == "<- Back"
      redirect_to "http://localhost:3000/shopper/index"
    end
    if params[:placeOrder] == "Place Order"
      session["creditCardNo"] = params[:creditCardNo]
      session["address"] = params[:address]
      session["name"] = params[:name]
      redirect_to "http://localhost:3000/shopper/order", notice: "Order placed successfully"
    end
    @userCart = Cart.where(userId: session["userid"])
---
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "neha"]]

  def order
    userCart = Cart.where(userId: session["userid"])
    generatedOrderId = "order-#{SecureRandom.hex}"
    userCart.each do |cartItem|
      order = Order.new
      order.orderid = generatedOrderId
      order.userid = session[:userid]
      order.productName = cartItem.productName
      order.quantity = cartItem.quantity
      order.price = cartItem.cost
      order.creditCardNo = session["creditCardNo"]
      order.address = session["address"]
      order.name = session["name"]
      order.save
    end
    session.delete(:creditCardNo)
    session.delete(:address)
    session.delete(:name)
    Cart.where(userId: session["userid"]).destroy_all
---
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "neha"]]
INSERT INTO "orders" ("orderid", "userid", "productName", "quantity", "price", "created_at", "updated_at", "creditCardNo", "address", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 12]]